#include <iostream>
#include <ModulesRud.h>
using namespace std;

void test1(){
    /* Тестові кейси */
    int tc[10][5] {{8,8,8,8,8},{9,8,8,8,8},{10,10,8,8,8},{7,8,7,8,7},{6,10,13,5,4},{5,5,5,5,5},{3,3,3,3,10},{9,0,0,5,10},{10,9,9,10,9},{0,0,0,0,0}};
    /* Тестовий результат */
    int result[10][2] {{1600,1302},{1900,1546},{2200,1790},{1480,1204},{1840,1497},{1000,814},{1100,895},{0,0},{3100,2523},{0,0}};

    for(int i=0;i<10;i++){
        auto [var1,var2] = task9_1(tc[i]);
        if(var1 == result[i][0] && var2 == result[i][1]){
            cout << (var1) << "\t" << (var2) << "\t" << "PASSED" << endl;
        }else{
            cout << "FAILED";
        }
    }
}
void test2(){
    /* Тестові кейси */
    int tc[10] {23,25,27,29,31,32,34,35,36,37};
    /* Тестовий результат */
    std::string result[10][2] {{"8","37/38"},{"9","39/40"},{"10","41/42"},{"11","43/44"},{"12","45/46"},{"Не існує","Не існує"},{"Не існує","Не існує"},{"Не існує","Не існує"},{"Не існує","Не існує"},{"Не існує","Не існує"}};

    for(int i=0;i<10;i++){
        auto [var1,var2] = task9_2(tc[i]);
        if(var1 == result[i][0] && var2 == result[i][1]){
            cout << "Розмір шкарпеток в США/Великобританії: " << var1 << endl;
            cout << "Розмір шкарпеток в ЄС: " << var2 << endl;
            cout << "PASSED" << endl;
        }else{
            cout << "FAILED" << endl;
        }
    }
}
void test3(){
    /* Тестові кейси */
    int tc[10] {7,5,100,1212,13121,141520,301234,0,-1,7000000};
    /* Тестовий результат */
    int result[10] {3,2,3,5,6,12,11,0,-1,11};

    for(int i=0;i<10;i++){
        if(task9_3(tc[i]) == result[i]){
            cout << "Кількість двійкових " << (task9_3(tc[i]) > 0 ? "нулів" : "одиниць") << " у числі " << tc[i] << " залежно від 7 біту: " << task9_3(tc[i]) << endl;
            cout << "PASSED" << endl;
        }else{
            cout << "FAILED" << endl;
        }
    }
}
int main()
{
    cout << "TS1" << endl;
    test1();
    cout << "TS2"<< endl;
    test2();
    cout << "TS3"<< endl;
    test3();
    return 0;
}
